Revit 2026 API

# PDFExportOptionsPaperFormat Property

---

Paper format.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ExportPaperFormat PaperFormat { get; set; }
```
```vb
Public Property PaperFormat As ExportPaperFormat
	Get
	Set
```
```cpp
public:
property ExportPaperFormat PaperFormat {
	ExportPaperFormat get ();
	void set (ExportPaperFormat value);
}
```
```fsharp
member PaperFormat : ExportPaperFormat with get, set
```

#### Property Value

ExportPaperFormat

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The input paper format is invalid |

When the PaperFormat is ExportPaperFormat.Default, which means "Use Sheet Size".

#### Reference

PDFExportOptions Class

Autodesk.Revit.DB Namespace